# Задача 12: Петя и Катя – брат и сестра. Петя – студент, 
# а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), 
# а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2
# 5 6 -> 2 3

s = int(input("Сумма чисел: ")) 
p = int(input("Произведение чисел: "))
for y in range(0, 1001):
    for x in range(0, 1001):
        if x + y == s and x * y == p:
            print(",".join((str(x), str(y))))

# P.S.  не понял задачу. над ней сидел минут 40-60. далее полез в чат за ответами)
#       наткнулся на ваше решение (представленное ниже). и его не понял. 
#       но через минут 10 + помощь Гугла я все таки понял решение задачи. и понял что действительно можно написать 
#       в 2 строки решение. но все таки в 6 сток пока что для меня понятнее выглядит. 

# s, p = int(input("Сумма чисел: ")), int(input("Произведение чисел: "))
# print(*[",".join((str(x), str(y))) for y in range(0, 1001) for x in range(0, 1001) if x + y == s and x * y == p])

# P.P.S третий семинар еще не смотрел. еще. 
