# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, 
# а некоторые – гербом. Определите минимальное число монеток, которые нужно 
# перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть.
# 5 -> 1 0 1 1 0
# 2

n = int(input('Введите кол-во монеток :  '))
eagle = 0
tails = 0
for i in range(n):
    money = int(input("Введите 0 или 1. где 0 это решка, а 1 это орел:  "))
    if money == 1:
        eagle += 1
    else:
        tails += 1
if eagle > tails:
    print(f'надо перевернуть монетку с решкой , их меньше ,а именно :  {tails}')
elif tails > eagle:
    print(f'надо перевернуть монетку с орлом, их меньше ,а именно :  {eagle}')
else:
    print(f'их одинаковое количество , переверни что хочешь ! ')